---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SweepProfile Properties
SweepProfile Class See Also Send Feedback
---

The SweepProfile type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |

# See Also

SweepProfile Class

Autodesk.Revit.DB Namespace